 > remove:
Node 6. Fragment:
group (
  group <<<(
    assign (x, 3)
  )>>>
)


 > remove:
Node 9. Fragment:
group (
  group (
    assign <<<(x, 3)>>>
  )
)


 > invalidate:
Node 3. Fragment:
group <<<(
  empty ()
)>>>


 > create:
Node 24. Fragment:
group (
  empty <<<()>>>
)


