 > remove:
group (
  group <<<(
    assign (x, 3)
  )>>>
)


 > remove:
group (
  group (
    assign <<<(x, 3)>>>
  )
)


 > create:
group (
  empty <<<()>>>
)


 > invalidate:
group <<<(
  empty ()
)>>>


