 > create:
>:2
date"2016-03-04"-today<<<>>>>5month


 > create:
-:3
date"2016-03-04"<<<->>>today>5month


 > create:
date:4
<<<date>>>"2016-03-04"-today>5month


 > create:
atom:5
date<<<"2016-03-04">>>-today>5month


 > create:
atom:6
date"2016-03-04"-<<<today>>>>5month


 > create:
month:7
date"2016-03-04"-today>5<<<month>>>


 > create:
atom:8
date"2016-03-04"-today><<<5>>>month


 > merge:
expression 1 {
  result: > 2 >> 1 {
    left: - 3 >> 2 {
      left: date 4 >> 3 {
        operand: atom 5 >> 4
      }
      right: atom 6 >> 3
    }
    right: month 7 >> 2 {
      operand: atom 8 >> 7
    }
  }
}

